{
  "basics": {
    "name": "Josh Walton",
    "image": "",
    "email": "joshua.walton@manchester.ac.uk",
    "Webpage": "https://joshjwalton.github.io",
    "summary": "A final year PhD student, with 4 years of programming experience using Magma, researching maximal subgroups and representation theory of finite groups of Lie type through the means of the computational algebra. I aspire to further my career with a post-doctoral research role involving the development and implementation of computational algebra to solve open problems in algebra, group theory and representation theory. I am an articulate and clear communicator of mathematics with a strong university level teaching portfolio.",
  
    "profiles": [
      {
        "network": "LinkedIN",
        "username": "josh-walton-19b682214",
        "url": "www.linkedin.com/in/josh-walton-19b682214"
      }
    ]
  },
  "education": [
    {
      "institution": "University of Manchester",
      "location": "Manchester, U.K",
      "area": "Thesis Title: Potential Maximal Subgroups of $$E_8(3)$$, $$E_8(2)$$ and The Maximal Tori of Finite Exceptional Groups of Lie Type.",
      "studyType": "PhD",
      "startDate": "2021",
      "endDate": "Present",
      "score": "10",
      "courses": ["Specialise in computational algebra using the software package Magma.","Researching large dimensional matrix representations of finite groups of Lie type and their maximal subgroups"]
    },
    {
      "institution": "University of Manchester",
      "location": "Manchester, U.K",
      "area": "Mathematics",
      "studyType": "MMath",
      "startDate": "2017",
      "endDate": "2021",
      "score": "10",
      "courses": ["Awarded first class honours including 91% in extended master's dissertation on Sylow p-subgroups and Hall Pi-subgroups."]
    },
    {
      "institution": "Runshaw College",
      "location": "Leyland, U.K",
      "studyType": "A-Levels",
      "startDate": "2015",
      "endDate": "2017",
      "score": "10",
      "courses": ["Mathematics (A*), Further Mathematics (A), Physics (A), European Modern History (A)"]
    }
  ],
  "awards": [
    {
      "title": "Fully Funded 4 Year PhD Studentship",
      "date": "2021",
      "awarder": "EPSRC",
      "url": "https://gtr.ukri.org/person/029F774A-365D-4CAF-BB7E-D400295E29B2?term=&selectedFacets=&fields=&type=&fetchSize=25&page=1&selectedSortableField=score&selectedSortOrder=DESC",
      "summary": "A fully funded PhD studentship to research certain subgroup structures of exceptional finite simple groups."
    },
    {
      "title": "Two Funded Workshops",
      "date": "2022",
      "awarder": "Heilbronn Institite of Mathematics",
      "summary": "Two funded workshops, both in 2022, working with a small group of fellow mathematicians identifying potential maximal subgroups of $$E_8(3)$$."
    },
    {
      "title": "School of Mathematics Entrance Scholarship",
      "date": "2017",
      "awarder": "The University of Manchester",
      "summary": "Scholarship awarded for outstanding academic achievement at A-level."
    },
    {
      "title": "AI Python Competition",
      "date": "2019",
      "awarder": "N Brown Group",
      "url": "https://www.manchester.ac.uk/about/news/maths-students-win-n-brown-coding-competition-prizes/",
      "summary": "Awarded 3rd place in 2019 in a Python coding competition sponsored by the N Brown Group. This competition was based on coding an AI opponent that the player could play against in the game 'Othello'."
    }
  ],

  "publications": [
    {
      "name": "The Maximal Tori of Finite Exceptional Groups of Lie Type",
      "publisher": "Communications in Algebra",
      "releaseDate": "05/2024",
      "url": "https://www.tandfonline.com/doi/full/10.1080/00927872.2024.2358418",
      "summary": "A complete and comprehensive classification of the maximal tori of finite exceptional groups of Lie type."
    },
    {
      "name": "The Maximal Subgroups of E_8(3) - Part 1",
      "summary": "Unpublished manuscript presenting some of the work classifying the maximal subgroups of E_8(3)."
    }
  ],
  "skills": [
    {
      "name": "Mathematics",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "summary": "maths here ...",
      "keywords": [
        "4 years programming experience with the computational algebra package Magma, ran on Linux machines, including (but not limited to) working with large matrix representations of groups and subsequent subgroups, group modules of high dimension, maximal tori, root systems and subsystems, groups of Lie type and parabolic subgroups, irreducible modules over finite fields and their projective covers.",
        "Designing and modifying mathematical algorithms in algebra, group theory, representation theory and Lie group theory and then implementing them to run efficiently in Magma. This includes writing, modifying and testing code for constructing centralisers, normalisers, parabolic subgroups and their subsequent Levi-complements, maximal tori, maximal and non-maximal proper subgroups and group modules.",
        "Experienced at handling vast amounts of data produced from code output whilst working with a limited storage capacity. This includes how to store data efficiently and organise it to ensure easy use and access in the future.",
        "Experience using other languages and applications such as Python, C++ and MATLAB.",
        "Experience working in a lively research environment and collaborating with other mathematicians on larger projects.",
        "Clear and strong communicator of mathematics with 7+ years experience using LaTeX."
      ]
    }
  ],
  "interests": [
    {
      "name": "Computational Algebra and Software Development",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Drive research in computational pure mathematics, in particular algebra and group theory, through the development of Magma by designing and implementing new algorithms and modifying existing code to improve efficiency, functionality and ease of use. As part of this development, expand the current database stored in Magma by incorporating known data not yet stored and integrating new data sets as current knowledge expands.",
        "Matrix representations of finite exceptional groups of Lie type (especially those of high dimension) and their maximal subgroups and root systems.",
        "Research open problems in computational pure mathematics, in particular algebra and group theory, through the design and implementation of new algorithms.",
        "Identifying connections between work being done in computational algebra and group theory to other areas of mathematics."
      ]
    }
  ],
  "references": [
    {
      "name": "Professor Peter Rowley",
      "icon": "fa-solid fa-laptop",
      "reference": "Email: peter.rowley@manchester.ac.uk"
    },
    {
      "name": "Dr Richard Webb",
      "icon": "fa-solid fa-laptop",
      "reference": "Email: richard.webb@manchester.ac.uk"
    },
    {
      "name": "Dr Marianne Johnson",
      "icon": "fa-solid fa-laptop",
      "reference": "Email: marianne.johnson@manchester.ac.uk"
    },
    {
      "name": "Professor Louise Walker",
      "icon": "fa-solid fa-laptop",
      "reference": "Email: louise.walker@manchester.ac.uk (teaching reference)"
    }
  ]
}
